//----------------------------------------------------------------------------------------------------
//подключаемые библиотеки
//----------------------------------------------------------------------------------------------------
#include "button.h"
#include "stm32f4xx_hal.h"

#include <stdbool.h>
#include <stdint.h>

//----------------------------------------------------------------------------------------------------
//макроопределения
//----------------------------------------------------------------------------------------------------

//кнопка "сохранить кадр"
#define BUTTON_GPIO_PIN_SAVE		GPIO_PIN_5
#define BUTTON_GPIO_SAVE				GPIOE

//----------------------------------------------------------------------------------------------------
//инициализация кнопок
//----------------------------------------------------------------------------------------------------
void BUTTON_Init(void)
{
 __HAL_RCC_GPIOE_CLK_ENABLE();
	
 //настроим кнопки
 GPIO_InitTypeDef Button_GPIO_Init;

 Button_GPIO_Init.Mode=GPIO_MODE_INPUT;
 Button_GPIO_Init.Pull=GPIO_PULLDOWN;
 Button_GPIO_Init.Speed=GPIO_SPEED_FREQ_VERY_HIGH;
	
 Button_GPIO_Init.Pin=BUTTON_GPIO_PIN_SAVE;
 HAL_GPIO_Init(BUTTON_GPIO_SAVE,&Button_GPIO_Init);
}
//----------------------------------------------------------------------------------------------------
//получить состояние кнопки "сохранить кадр"
//----------------------------------------------------------------------------------------------------
bool BUTTON_GetSaveState(void)
{
 if (HAL_GPIO_ReadPin(BUTTON_GPIO_SAVE,BUTTON_GPIO_PIN_SAVE)==GPIO_PIN_SET) return(true);	
 return(false);	
}
