#ifndef BUTTON_H
#define BUTTON_H

//----------------------------------------------------------------------------------------------------
//подключаемые библиотеки
//----------------------------------------------------------------------------------------------------
#include <stdbool.h>
#include <stdint.h>

//----------------------------------------------------------------------------------------------------
//прототипы функций
//----------------------------------------------------------------------------------------------------

void BUTTON_Init(void);//инициализация кнопок
bool BUTTON_GetSaveState(void);//получить состояние кнопки "сохранить кадр"

#endif



