#ifndef C_DISPLAY_SPFD5408_H
#define C_DISPLAY_SPFD5408_H

//****************************************************************************************************
//Класс дисплея SPFD5408
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "cdisplaybased.h"

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//Класс дисплея SPFD5408
//****************************************************************************************************
class CDisplaySPFD5408:public CDisplayBased
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CDisplaySPFD5408(void);
  //-деструктор-----------------------------------------------------------------------------------------
  virtual ~CDisplaySPFD5408();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  virtual void InitGPIO(void);//инициализация контактов дисплея
  virtual void Init(void);//инициализация LCD-экрана
  virtual void SetWindow(uint16_t x_left,uint16_t y_top,uint16_t x_right,uint16_t y_bottom);//задать окно вывода пикселей
  virtual void OutColor(uint16_t color);//передать цвет точки
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
  void CS_One(void);//выставить на CS 1
  void CS_Zero(void);//выставить на CS 0

  void RS_One(void);//выставить на RS 1
  void RS_Zero(void);//выставить на RS 0

  void WR_One(void);//выставить на WR 1
  void WR_Zero(void);//выставить на WR 0

  void RST_One(void);//выставить на RST 1
  void RST_Zero(void);//выставить на RST 0

  void RD_One(void);//выставить на RD 1
  void RD_Zero(void);//выставить на RD 0

  void SetData(uint8_t byte);//задать значение на шине данных

  void Write8(uint8_t byte);//передать байт
  void Write16(uint16_t value);//передать 16 бит 
  void WriteRegister8(uint8_t reg,uint8_t value);//записать в регистр 8 бит
  void WriteRegister16(uint16_t reg,uint16_t value) ;//записать в регистр 16 бит
  void Reset(void);//выполнить сброс 
};

#endif
