#ifndef C_DISPLAY_STANDARD_LIBRARY_H
#define C_DISPLAY_STANDARD_LIBRARY_H

//****************************************************************************************************
//Стандартная библиотека для дисплея
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "idisplay.h"

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//Стандартная библиотека для дисплея
//****************************************************************************************************
class CDisplayStandardLibrary
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
  static const int32_t FONT_HEIGHT=14;//высота шрифта
  static const int32_t FONT_WIDTH=8;//ширина шрифта
 private:
  //-переменные-----------------------------------------------------------------------------------------
  int32_t PrintYPosition;//позиция вывода строки
  uint16_t ClearColor;//цвет очистки экрана
  IDisplay *iDisplay_Ptr;//указатель на класс дисплея с которым производится работа
  bool OrientationVertical;//вертикальная ориентация
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CDisplayStandardLibrary(IDisplay *iDisplay_Ptr_Set,bool orientation_vertical=true);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CDisplayStandardLibrary();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  void PutSymbol(int32_t x,int32_t y,char symbol,uint16_t color);//вывод символа в позицию
  void PutString(int32_t x,int32_t y,const char *string,uint16_t color);//вывод строчки в позицию
  void Print(const char *string,uint16_t color);//вывести текст в текущую позицию
  void Clear(uint16_t color);//сбросить текущую позицию и очистить дисплей 
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
  void PutSymbolVertical(int32_t x,int32_t y,uint8_t symbol,uint16_t color);//вывод символа в позицию в вертикальной ориентации
  void PutSymbolHorizontal(int32_t x,int32_t y,uint8_t symbol,uint16_t color);//вывод символа в позицию в горизонтальной ориентации
};

#endif
